sist/oldSist/SiSTUDDI/teste/xml/discard_authToken.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>  
    <discard_authToken generic="2.0" xmlns="urn:uddi-org:api_v2">
      <authInfo>MyAuthInfo</authInfo>
    </discard_authToken>
  </s:Body>
</s:Envelope>