SiSTUDDI/teste/xml/delete_business.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <delete_business generic="2.0" xmlns="urn:uddi-org:api_v2">
      <authInfo></authInfo>
      <businessKey>12DA04BA-10E1-4A13-BB41-00BD30F72CDA</businessKey>
    </delete_business>
  </s:Body>
</s:Envelope>