SiSTUDDI/teste/xml/delete_service.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>  
    <delete_service generic="2.0" xmlns="urn:uddi-org:api_v2">    
      <authInfo>MyAuthInformation</authInfo>
      <serviceKey>myServiceKey</serviceKey>  
    </delete_service>
  </s:Body>
</s:Envelope>